//【例2.16】  算术、关系、逻辑、赋值运算符的混合使用。
#include <iostream.h>
void main()
{	
	int z1,z2;
	z1= 3>5 && 2 || 8<4-!0;/* 等价于 ((3>5)&&2)||(8<(4-(!0)))
                                     = (0&&2)||(8<(4-1))
                                     = 0||0
                                     = 0 */
	cout<<"  z1= "<<z1;    //z=1表示false
	int a=3, b=4, c=5;
	z2= !(a+b)+c-1&&b+c/2; /*等价于 (!(a+b)+c-1)&&(b+(c/2)) 
						         = (0+5-1)&&(4+2)
                                     = 4&&6
                                     = 1 */
     cout<<"  z2= "<<z2;   //z2=1表示true
}
