/*
 一个自然数被8整除余1，所得的商被8除也余1,再将第二次的商被8除后余7，最后得到的一个商为a。
 又知这个自然数被17除余4，所得的商被17除余15,最后得到一个商是a的2倍。求这个自然数。
 */
#include "iostream.h"
void main1()
 {
	long t,x,y,a,w,v,v1,v2,v3,v4;
 
    for(t = 506166200L; ; t++)
	{
		x = t%8L; //1
		w = t/8L; 
		y = w%8L;//1
		a = w/8L; //a
		v = a%8L; //7
		v1 = a%17L;//4
		v2 = a/17L;
		v3 = v2%17L;//15
		v4 = v2/17L;  
		if(x==1&&y==1 && v == 7&& v1==4&& v3==15&& v4== 2*a)
		{ 
		
			cout<<t<<"\t";  break;
		}
	}
	cout<<"\n";
}
void main()
 {
	 long t,x,y,a,w,u;
  /*  t = 8*x+1;           //一个自然数被8整除余1
	x = 8*y+1;			 //所得的商被8除也余1
	y = 8*a+7;           //再将第二次的商被8除后余7
	a = 17*w+4;          //最后得到的一个商为a。又知这个自然数被17除余4，
	w = 17*u+15;         //所得的商被17除余15
	u = 2*a;      */       //最后得到一个商是a的2倍
    for(u = 2L;  ;u+=2L)
	{
		w = 17*u+15; 
		a = 17*w+4;  
		if(u == 2*a)
		{ 
			y = 8L*a+7L; 
			x = 8L*y+1L;			 //所得的商被8除也余1
		    t = 8L*x+1L;           //一个自然数被8整除余1
			cout<<t<<"\t"; break;
		}
	}
	cout<<"\n";
}